Revit 2026 API

# EdgeGetCurveUV(Int32) Method

---

Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveUV GetCurveUV(
	int index
)
```
```vb
Public Function GetCurveUV (
	index As Integer
) As CurveUV
```
```cpp
public:
CurveUV^ GetCurveUV(
	int index
)
```
```fsharp
member GetCurveUV :
        index : int -> CurveUV
```

#### Parameters

index Int32
    The index of the face (0 or 1).

#### Return Value

CurveUVIf successful, returns the calculated CurveUV,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the specified index is not 0 or 1. |

#### Reference

Edge Class

GetCurveUV Overload

Autodesk.Revit.DB Namespace